export const contendData = [
  {
    id: 0,
    text: "<p class='text-7xl text-center'>3D-моделювання</p> ",
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709050040/Presentation/jlbnembv0iz6psejqzmj.gif",
  },
  {
    id: 1,
    title: "План презентації",
    list: [
      "<strong class='text-3xl'>Введення</strong>",
      "<strong class='text-3xl'>1. Поняття 3D-моделювання.</strong>",
      "<strong class='text-3xl'>2. Основні підходи 3D-моделювання.</strong>",
      "<strong class='text-3xl'>3. Інструменти та програмне забезпечення.</strong>",
      "<strong class='text-3xl'>4. Застосування 3D-моделювання в різних сферах.</strong>",
      "<strong class='text-3xl'>5. Тренди та майбутнє 3D-моделювання.</strong>",
      "<strong class='text-3xl'>Висновок</strong>",
    ],
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709050864/Presentation/ttogawhanwzdpivkefbl.png",
  },
  {
    id: 2,
    title: "Поняття 3D-моделювання",
    text: "<p class='text-3xl'><strong>3D-моделювання</strong> - це процес розробки математичного, заснованого на координатах, тривимірного представлення анімованих чи живих об'єктів та поверхонь. 3D-модель, як результат 3D-моделювання, являє собою збір даних, який створюється шляхом маніпулювання вершинами, ребрами та полігональною сіткою в тривимірному просторі.</p>",
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709051157/Presentation/pphtezbfvknl71mtnwbd.png",
  },
  {
    id: 3,
    title: "Основні підходи 3D-моделювання",
    text: "<p class='text-2xl'>У світі 3D-моделювання існує безліч різних технік і методів, які використовуються для створення 3D-об'єктів. Серед них найбільш поширеними є полігональне моделювання, скульптинг, NURBS (Nonlinear Guided Reference Surfaces), а також багато інших інструментів і технік. Давайте детальніше розглянемо кожне з цих понять і дізнаємося, як вони застосовуються в практиці 3D-моделювання.</p>",
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709051782/Presentation/fwsz2mw9jrhtpeosnous.avif",
    imagePosition: "right",
  },
  {
    id: 4,
    title: "Полігональне моделювання",
    text: "<p class='text-xl'>Полігональне моделювання є одним з найпоширеніших методів створення тривимірних об'єктів. Він заснований на використанні безлічі багатокутників, таких як трикутники або квадрати, для формування поверхні моделі. У процесі полігонального моделювання художник або дизайнер створює модель, розбиваючи її на окремі багатокутники та маніпулюючи їхньою формою та розташуванням. Цей метод дозволяє створювати деталізовані та складні об'єкти, такі як персонажі, автомобілі, архітектурні споруди тощо. Полігональне моделювання широко використовується в різних галузях, включаючи ігрову індустрію, анімацію, візуалізацію архітектурних проектів, створення спецефектів у кіноіндустрії.</p>",
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709052683/Presentation/fiqayuaijvv735bzcbhe.jpg",
  },
  {
    id: 5,
    title: "Скульптинг",
    text: "Скульптинг - це техніка моделювання, яка дозволяє художникам і дизайнерам створювати тривимірні об'єкти, додаючи і виділяючи матеріал за допомогою спеціальних скульптурних інструментів. На відміну від полігонального моделювання, скульптинг дозволяє працювати з моделлю так, ніби це фізичний об'єкт, підтримуючи органічні форми та дозволяючи створювати більш органічні та природні текстури та деталі. Скульптура широко використовується у створенні персонажів, анімації та спецефектах у кіноіндустрії, а також у різних сферах мистецтва та дизайну",
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709053033/Presentation/l17q5ymwaigzikyactnd.png",
    imagePosition: "right",
  },
  {
    id: 6,
    title: "NURBS",
    text: "NURBS (Nonlinear Guided Reference Surfaces) — це математична модель, яка використовується в комп'ютерній графіці для створення гладких і криволінійних об'єктів. Вони являють собою поверхні, якими можна керувати і які підтримують плавні переходи між контрольними точками. На відміну від полігонального моделювання, де об'єкти створюються з безлічі полігонів, NURBS дозволяє створювати об'єкти, які можуть бути більш плавними та реалістичними. Цей метод моделювання широко використовується в архітектурі, автомобілебудуванні, аерокосмічній промисловості та інших додатках, які вимагають створення складних і органічних форм. ",
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709053148/Presentation/pirya0wz9a9jphbrqxmq.png",
  },
  {
    id: 7,
    title: "Програми для 3D-моделювання",
    text: "При створенні тривимірних моделей важливо вибрати правильну програму, яка відповідає вашим потребам та надає необхідний інструментарій. В індустрії 3D існує безліч програм, кожна з яких має свої особливості та функціональність. Ось декілька з них: ",
    list: [
      "1. <strong>Blender</strong> - безкоштовна програма з відкритим вихідним кодом, що володіє широким спектром функцій для моделювання, анімації, текстурування та багато іншого.",
      "2. <strong>Autodesk Maya</strong> - потужний інструмент для 3D-моделювання, відомий своєю високою якістю рендерингу та анімацією.</p>",
      "3. <strong>3ds Max</strong> - інша продукція від Autodesk, що використовується для моделювання, анімації та рендерингу тривимірних об'єктів.",
      "4. <strong>ZBrush</strong> - програма для моделювання та текстурування заснована на концепції 'цифрового скульптурування', яка дозволяє художникам створювати деталізовані 3D-моделі.",
      "5. <strong>Sweet Home 3D</strong> - безкоштовна програма для дизайну інтер'єру, яка дозволяє користувачам створювати 3D-моделі приміщень, меблів та декору.",
    ],
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709053760/Presentation/v8irkdxudn3x3mlii1se.jpg",
  },
  {
    id: 8,
    title: "Практичне застосування 3D-моделювання",
    text: "<p class='text-2xl'>В наш час 3D-моделювання все частіше та частіше застосовуються в практичних сферах, таких як архітектура, ігрова індустрія, медицина, дизайн та багато інших галузей. Далі ми розглянумо декілька найбільш популярних нарямків.</p>",
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709053964/Presentation/zxeufkhpohxbu3qcs1gl.jpg",
    imagePosition: "right",
  },
  {
    id: 9,
    title: "Застосування 3D-моделювання в архітектурі",
    text: "У сучасній архітектурній практиці 3D-моделювання відіграє ключову роль, надаючи можливість створювати реалістичні візуалізації проектів та оптимізувати процеси проектування. За допомогою 3D-моделювання архітектори можуть створювати 3D-моделі своїх проектів, починаючи від ескізів і закінчуючи детальними візуалізаціями, що дозволяє їм представити кінцевий результат клієнтам у більш наочному та зрозумілому вигляді",
    listName: "Приклади 3D-моделей в архітектурі:",
    list: [
      "<strong>Моделі будівель і споруд:</strong> в тому числі житлових, офісних будівель, торгових центрів, пам'яток архітектури і т.д.",
      "<strong>Планування приміщень та інтер'єрів:</strong> створення візуалізацій для дизайн-проектів інтер'єру, розстановка меблів, освітлення та декор.",
      "<strong>Ландшафтні проекти:</strong> моделювання навколишнього середовища, ландшафтний дизайн, озеленення вулиць та ін.",
    ],
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709054335/Presentation/d96zrzqjk4ixnicz9cai.png",
  },
  {
    id: 10,
    title: "Застосування 3D-моделювання в ігровій індустрії",
    text: "В ігровій індустрії 3D-моделювання відіграє ключову роль, забезпечуючи створення віртуальних світів, персонажів і об'єктів, які привертають увагу гравців і забезпечують унікальний ігровий досвід. За допомогою 3D-моделювання розробники ігор можуть створювати унікальні та реалістичні ігрові світи, що складаються з різноманітних ландшафтів, архітектурних споруд, природних об'єктів тощо. Крім того, 3D-моделювання дозволяє створювати тривимірних персонажів з різноманітною зовнішністю, анімацією та поведінкою, що додає ігровому світу глибини та автентичності.",
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709054734/Presentation/spz585osenei5mtsujdg.png",
  },
  {
    id: 11,
    title: "Застосування 3D-моделювання в медицині",
    list: [
      "У медицині 3D-моделювання відіграє значну роль, відкриваючи нові можливості для діагностики, лікування та навчання. За допомогою 3D-моделювання лікарі можуть створювати тривимірні моделі органів і тканин людського тіла, що дозволяє отримати більш точну картину патологій, аномалій і захворювань, а також планувати хірургічні втручання і процедури.",
      "Одним з основних застосувань 3D-моделювання в медицині є створення індивідуалізованих моделей органів і структур при підготовці до хірургічних операцій. Це дозволяє хірургам розробляти оптимальні стратегії лікування, мінімізувати ризики та підвищувати успішність операцій. Крім того, 3D-моделювання використовується для створення індивідуальних протезів та імплантатів, а також для розробки нових медичних приладів та технологій.",
      "У сфері освіти та досліджень важливу роль відіграє і 3D-моделювання, що надає можливість візуалізувати складні анатомічні структури та патології, навчати студентів-медиків, проводити наукові дослідження.",
    ],
    youTubeLink: "https://www.youtube.com/watch?v=Qno-7iXGAq0",
  },
  {
    id: 12,
    title: "Застосування 3D-моделювання в інженерії",
    text: "В інженерії 3D-моделювання є невід'ємною частиною проектування, розробки та виробництва різних технічних систем, механізмів і конструкцій.",
    listName: "Приклади застосування 3D-моделей в інженерії:",
    list: [
      "<strong>Проектування механічних систем:</strong> Інженери можуть використовувати 3D-моделі для створення складних механічних систем, таких як автомобілі, літаки або промислові машини. Вони можуть візуалізувати різні компоненти і взаємодії між ними, щоб забезпечити оптимальну роботу всієї системи",
      "<strong>Аналіз міцності та життєвого циклу виробів:</strong> За допомогою 3D-моделювання інженери можуть виконувати різноманітні симуляції, щоб визначити, як продукт буде поводитися під навантаженням або в різних умовах експлуатації. Це дозволяє вдосконалювати конструкцію і покращувати якість виробу.",
      "<strong>Розроблення прототипів і випробування:</strong> За допомогою 3D-моделювання інженери можуть швидко створювати прототипи нових продуктів або компонентів і випробовувати їх у віртуальному середовищі.",
    ],
    youTubeLink: "https://www.youtube.com/watch?v=kMi_0HXXaTE",
  },
  {
    id: 13,
    title: "Застосування 3D-моделювання в наукових дослідженнях",
    text: "За допомогою 3D-моделювання та візуалізації вчені можуть створювати тривимірні моделі об'єктів та явищ, вивчати їх структуру та динаміку, проводити візуальний аналіз результатів експериментів та спостережень.",
    listName: "Приклади застосування 3D-моделей в наукових дослідженнях:",
    list: [
      "<strong>Створення моделей кліматичних змін:</strong> Вчені використовують 3D-моделі для імітації кліматичних змін та їх впливу на різні екосистеми. Це дозволяє прогнозувати майбутні зміни в кліматі та розробляти стратегії адаптації до них.",
      "<strong>Моделювання геологічних процесів:</strong> Вчені створюють 3D-моделі геологічних утворень, таких як гори, вулкани, зсуви та інші геологічні явища, щоб вивчати їхню структуру, формування та можливі наслідки для навколишнього середовища.",
      "<strong>Дослідження біорізноманіття:</strong> За допомогою 3D-моделювання вчені можуть аналізувати різноманіття життя в різних екосистемах, вивчаючи взаємодію між різними видами рослин і тварин, а також їх середовищем існування",
    ],
    youTubeLink: "https://www.youtube.com/watch?v=FJBfsafRhb0",
  },
  {
    id: 14,
    title: "Тенденції 3D-моделювання",
    list: [
      "Наразі тенденції 3D-моделювання пердбачають його широку інтеграцію в різні аспекти повсякденного життя, розробку нових технологій та інструментів для створення та візуалізації 3D-контенту.",
      "В даний час спостерігається різке зростання інтересу до технологій віртуальної реальності (VR), доповненої реальності (AR) і 3D-друку, які знаходять все більш широке застосування в різних галузях. Далі розглянемо сфери детальніше.",
    ],
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709059759/Presentation/oscowcowrzgxkksatkwf.png",
  },
  {
    id: 15,
    title: "Застосування 3D-моделювання у віртуальній реальності",
    list: [
      "<strong>Віртуальна реальність (VR)</strong> – це технологія, яка дозволяє користувачам занурюватися в змодельоване середовище, яке створюється за допомогою 3D-моделей і відтворюється за допомогою спеціалізованих пристроїв, таких як VR-окуляри.",
      "Одним з основних застосувань 3D-моделювання у віртуальній реальності є розробка віртуальних середовищ для навчання та тренувань. За допомогою 3D-моделей можна створювати 3D-симуляції реальних ситуацій і сценаріїв, що дозволяє слухачам отримати практичний досвід без ризику для здоров'я чи безпеки. Особливо це стосується медичної освіти, військової підготовки, авіаційної та космічної галузей та інших сфер.",
      "Крім того, 3D-моделювання у віртуальній реальності використовується для створення інтерактивного розважального контенту, такого як віртуальні ігри, симулятори та розважальні програми. Це дозволяє користувачам зануритися в унікальні віртуальні світи, взаємодіяти з різноманітними об'єктами та персонажами, переживати унікальні емоції та враження.",
    ],
    youTubeLink: "https://www.youtube.com/watch?v=kdu8WuKXi9Y",
  },
  {
    id: 16,
    title: "Застосування 3D-моделювання у доповненій реальності",
    list: [
      "<strong>Доповнена реальність (AR)</strong> – це технологія, яка додає віртуальні об'єкти та інформацію в реальний світ, як правило, за допомогою мобільних пристроїв або спеціальних окулярів. Використання 3D-моделювання в AR дозволяє створювати інтерактивні середовища, де віртуальні об'єкти інтегруються з реальним середовищем.",
      "Одним з основних застосувань 3D-моделювання в доповненій реальності є створення освітніх та інформаційних додатків, що дозволяють користувачам отримувати додаткову інформацію про реальні об'єкти і явища. За допомогою 3D-моделей можна візуалізувати складні процеси, архітектурні об'єкти, механізми та багато іншого, що робить навчання більш наочним та зрозумілим.",
      "3D-моделювання в доповненій реальності використовується для створення інтерактивних ігор і розважальних додатків, де користувачі можуть взаємодіяти з віртуальними об'єктами і персонажами в режимі реального часу.",
    ],
    youTubeLink: "https://www.youtube.com/watch?v=pWjqZH13Qvc",
  },
  {
    id: 17,
    title: "Застосування 3D-моделювання для 3D-друку",
    list: [
      "<strong>3D-друк</strong> – це технологія створення фізичних об'єктів на основі тривимірних моделей, шляхом нашарування матеріалу. Застосування 3D-моделювання в 3D-друку відіграє ключову роль у проектуванні та створенні об'єктів різної форми та складності, що призводить до інновацій у виробництві, дизайні та інших сферах.",
      "Одним з основних застосувань 3D-моделювання в 3D-друку є створення прототипів і функціональних деталей для промислових та інженерних цілей. За допомогою 3D-моделей можна швидко та ефективно розробляти та тестувати нові продукти та дизайни, скорочуючи час та витрати на розробку та реалізацію нових ідей.",
      "Також 3D-моделювання в 3D-друку використовується для створення індивідуальних і настроюваних продуктів, таких як медичні протези, ювелірні вироби, взуття та інші предмети, відкриваючи нові можливості для персоналізації та індивідуалізації продуктів.",
    ],
    youTubeLink: "https://www.youtube.com/watch?v=hrv0sDACB7M",
  },
  {
    id: 18,
    title: "Перспективи  розвитку технологій 3D-моделювання",
    list: [
      "Ґрунтуючись на сучасних тенденціях та інноваційних підходах, можна робити припущення щодо майбутнього розвитку технологій 3D-моделювання та їх потенційного впливу на бізнес та суспільство.",
      "По-перше, очікується, що інструменти та програмне забезпечення 3D-моделювання будуть надалі вдосконалюватися, що призведе до підвищення якості та ефективності процесу створення 3D-моделей.",
      "По-друге, очікується розширення сфер застосування 3D-моделювання, включаючи більш широке використання в медицині, освіті, будівництві та інших сферах. 3D-моделювання стане невід'ємною частиною повсякденного життя.",
      "По-третє, очікується розвиток нових форм 3D-моделювання, таких як генеративний дизайн та штучний інтелект, що дозволить автоматизувати процес створення 3D-моделей та покращити їх функціональність та ергономіку",
      "Нарешті, очікується, що інтеграція 3D-моделювання з іншими передовими технологіями, такими як штучна реальність, Інтернет речей і квантові обчислення, призведе до появи нових інноваційних продуктів.",
    ],
    image:
      "https://res.cloudinary.com/di8xukyyj/image/upload/v1709063389/Presentation/s8hxdpr5yf5zb2hglpcl.png",
  },
  {
    id: 19,
    title: "Висновок",
    list: [
      "Таким чином ми розглянули основні принципи та застосування 3D-моделювання, починаючи від його ролі в різних галузях і закінчуючи останніми тенденціями та майбутніми перспективами цієї технології.",
      "З усього наведеного вище робимо всновок що 3D-моделювання відіграє ключову роль у сучасній індустрії та суспільстві, надаючи нові можливості для творчості, інновацій та розвитку. Він стає невід'ємною частиною нашого повсякденного життя, полегшуючи процеси проектування, навчання та взаємодії з навколишнім світом.",
      "Важливо пам'ятати, що 3D-моделювання – це динамічна сфера, яка постійно розвивається, і вміння працювати з нею стає все більш затребуваною та цінною навичкою. Сподіваюся, що моя презентація допомогла вам краще зрозуміти суть і важливість 3D-моделювання в сучасному світі і надихнула вас зануритись у вичення цієї сфери.",
    ],
  },
  {
    id: 20,
    title: "ДЯКУЮ ЗА УВАГУ!",
  },
];
